---
kind: enumMember
id: F:Autodesk.Revit.DB.HorizontalTextAlignment.Center
enum: Autodesk.Revit.DB.HorizontalTextAlignment
source: html/f904dd9f-28ce-00fe-352f-03fd869e4199.htm
---
# Autodesk.Revit.DB.HorizontalTextAlignment.Center

Text is Center justified inside the containing text box, and the center side of the text box remains in place as the width changes.